// top level fuction [ task - src - dest - watch ]

/*
task : كإني بقول يا جلب نفذلي حاجة معينة فلازم استخدم التاسك عشان انفذ حاجة بالجلب
وطبعا التنفيذ بيكون لما اعمل رن للجلب 

*/

/* ********##_1_##******** */

/*
const  gulp = require('gulp');

// التاسك دي انا مسميها لوج
gulp.task ('log', async function() {
    console.log("hello")
})
//اول حاجة بندخل على السرس من خلال سرس , وبعدين بقله 
// اعمل بايب عشان هستخدم الملفات اللي جوه السورس دة اللي هو كل حاجة اخرها امتداد سي اس اس , فجهزهالي 
// وبقله اني عاوز اغير مسارها في منطقة تانية وهية سي اس اس تو
gulp.task ('move', async function() {
    gulp.src('css1/*.css').pipe(gulp.dest('css2'))
})
//اول حاجة بندخل على السرس من خلال سرس , وبعدين بقله 
// اعمل بايب عشان هستخدم الملفات اللي جوه السورس دة فجهزهالي 
// وبقله اني عاوز اغير مسارها في منطقة تانية وهية سي اس اس تو
// وابقى راقبلي التغيرات مش كل شوية هعمل واتش
gulp.task ('watching', async function() {
    gulp.watch('css1/*', async function () {
        gulp.src('css1/*').pipe(gulp.dest('css2'))
    })
})
*/

/* ********##_2_##******** */

//هنا احنا بنستخدم الجلب ساس هنفذ حجات علىالساس بإستخدام الجلب 
// وعشان نعمل دة لازم ننفذ الساس جوه جلب زي السطر الثالث دة
const  gulp = require('gulp');
const  gulpSass = require('gulp-sass');
const  sass = gulpSass(require('sass'));

//الفانكشن دي هتعمل ايه
//1- تص على الاندكس دوت سي اس اس
//2- يعمل كومبيل ليه باستخدام الساس 
//3- بعدين يحطه في فايل تاني
//-- هنا اللي بيتعمل انه بيحول الملف اللي هو اسمه
// اندكس دوت اس سي اس اس واللي فيه فاريبال كلور
// لفايل سي اس اس جوه فولدر اسمه سي اس اس بإستخدام الساس
gulp.task('sass', async function(){
    gulp.src('index.scss').pipe(sass()).pipe(gulp.dest('css'))
})

